{
    "Software Engineer": "A Software Engineer is an IT professional who designs, develops and maintains computer software. They apply software engineering to help solve new and ongoing problems for an organization.",
    "Creative Coder": "Creative Coding is a speciality that utilizes code and programming to create more expressive, designed and custom web designs. Programming's versatility and ubiquitous nature makes it especially expressive, allowing it to manifest itself as digital paintings, data visualization or even robotics.",
    "Network Engineer": "A Network Engineer is a technology professional who has the necessary skills to plan, implement and oversee the computer networks that support in-house voice, data, video and wireless network services.",
    "Security Architect": "Security Architects assess their organizations' systems for weaknesses. They conduct penetration tests, risk analyses, and ethical hacks on local area networks, wide area networks, and virtual private networks.",
    "Systems Analyst": "A Computer Systems Analyst works with companies, institutions and independent clients. They survey and diagnose database program issues, resolve user issues, and advise management about systems innovations to improve productivity.",
    "Data Scientist": "A Data Scientist is a proficient specialist who applies mathematical, problem-solving, and coding skills to manage big data, extracting valuable insights. They design tailor-made solutions from this data, aiding organizations in achieving their unique objectives and goals.",
    "Data Visualization Engineer": "Data Visualization Engineers/Specialists are responsible for the design and development of data visualizations and dashboards using data sets from various sources. They are experts in data and storytelling and use business intelligence (BI) tools to create user-friendly dashboards for business teams.",
    "Business Data Analyst": "A Business Analyst aims to identify opportunities to grow, optimize and improve an organization's business processes. They'll often be tasked with a specific area of business, such as supply chain management, customer service, or global trade practices.",
    "Data Manager": "A Data Manager is responsible for developing, overseeing, organizing, storing, and analyzing data and data systems. A data manager ensures that all of this is always done with the utmost security and confidentiality, and in a timely manner.",
    "Data Engineer": "Data Engineers work in a variety of settings to build systems that collect, manage and convert raw data into usable information for data scientists and business analysts to interpret. Their ultimate goal is to make data accessible so that organizations can use it to evaluate and optimize their performance.",
    "Machine Learning Engineer": "A Machine Learning Engineer builds artificial Intelligence systems that leverage huge data sets to generate and develop algorithms capable of learning and eventually making predictions.",
    "Artificial Intelligence Engineer": "Artificial Intelligence Engineers are responsible for developing, programming and training the complex networks of algorithms that make up AI so that they can function like a human brain. This role requires combined expertise in software development, programming, data science and data engineering.",
    "Mobile Application Developer": "A Mobile Application Developer uses programming languages and development skills to create, test and develop applications on mobile devices. They work in popular operating system environments like IOS and Android and often take into account UI and UX principles when creating applications.",
    "Mobile Software Engineer": "Mobile Software Engineers design, develop and implement software programs for smartphones and other mobile devices. They often specialize in a certain type of operating system, such as Android or IOS.",
    "Front-end Engineer": "A Front-end Engineer is responsible for ensuring that all the visible parts of a website or application function properly and can be properly accessed by the user. Common responsibilities include designing, installing and testing a website's user interface elements.",
    "Full Stack Developer": "A Full-Stack Developer is a professional responsible for working on both front-end and back-end development processes. They design, develop, and maintain fully-fledged and functioning platforms with databases or servers. These servers do not need other third-party applications to build an entire system from scratch.",
    "Back-end Developer": "Back-end Developer responsibilities include creating, maintaining, testing, and debugging the entire back end of an application or system. This includes the core application logic, databases, data and application integration, API, and other processes taking place behind the scenes.",
    "UX Engineer": "User Experience Engineers combine front end engineering with UX principles, and frequently collaborate with designers, researchers, and back-end engineers. A user experience (UX) engineer builds and designs digital products like websites and apps while using UX principles.",
    "UX Designer": "User Experience Designers measure and optimize applications (usually web-based) to improve ease of use (usability), and create the best user experience by exploring many different approaches to solve end-users' problems - conducting in-person user tests to observe behavior, for example.",
    "Interface Designer": "A User Interface (UI) Designer is a professional who collaborates with a User Experience (UX) designer to create an intuitive and visually appealing interface for product design. They focus on the look and feel of the interface to ensure a seamless user experience.",
    "Internet of Things Engineer": "An Internet of Things Engineer designs, codes, and tests sensors that enhance our products and transmit data for storing and analyzing. They help develop and test software and hardware applications that support product and company goals. Participate in product R&D and ensure market readiness. Determine data patterns that further algorithm development.",
    "Creative Technologist": "A Creative Technologist's role is hands-on, with a focus on conceptualizing, ideating, prototyping, designing and building tech-based creative solutions in close collaboration with creatives, technologists and other disciplines. You will be working on projects at a local, regional and global scale.",
    "Embedded Software Engineer": "Embedded Software Engineers design and code the programs that run these embedded systems. But unlike, say, application software developers, embedded software engineers need to understand the mechanics of the hardware and how the software and hardware should interact.",
    "Game Designer": "As a Game Designer, you'll bring ideas, build prototypes, create interactive narration and develop the game's mechanics. You'll design systems that are easily maintainable, expandable and comfortable to use, while injecting fun into the user experience.",
    "Video Game Tester": "A Game Tester, also referred to as a video game tester, is someone who plays video games, tests their features, and identifies glitches and bugs before game release. Game testers often work for video game companies and collaborate with game developers and programmers to improve games and ensure they're ready for users.",
    "Video Game Programmer": "The role of the Video Game Programmer is to develop the software to create video games. This involves assembling the platforms and engines that will power the games, as well as writing code for custom software to support the unique requirements of games.",
    "VR Developer": "The role of a VR Developer is to design and build interactive VR applications and experiences. Collaborate with 3D artists, designers, and other developers to deliver high-quality VR content. Optimize VR applications for performance, quality, and responsiveness. Test and debug VR applications on multiple VR platforms.",
    "Environment Artist": "Environment Artists make awesome places in which games can be played. They create fantasy landscapes – spooky dungeons and moody wastelands – and real-world places like offices and playgrounds too. They often start with 2D art created by a concept artist and turn it into a believable environment in 3D.",
    "VR Architect": "Virtual Reality (VR) Architects create fictional worlds for developers to turn into immersive experiences. You'll use all your 3D design skills to create engaging, multi-dimensional environments that easily lend themselves to the VR platform. Designing for VR calls for detail.",
    "Augmented Reality Engineer": "Augmented Reality Engineers are engineers working on AR and VR will often collaborate across scientific and engineering disciplines. The primary duties of an AR/VR engineer may include designing, analyzing, debugging and developing AR and VR prototypes."
  }
  